Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/Secure/firmware/src/packs/PIC32CK2051SG01144_DFP/component/sdmmc.h
#define SDMMC_NISIER_CMDC_Pos                 _UINT16_(0)                                          /* (SDMMC_NISIER) Command Complete Signal Enable Position */
#define SDMMC_NISIER_CMDC_Msk                 (_UINT16_(0x1) << SDMMC_NISIER_CMDC_Pos)             /* (SDMMC_NISIER) Command Complete Signal Enable Mask */
#define SDMMC_NISIER_CMDC(value)              (SDMMC_NISIER_CMDC_Msk & (_UINT16_(value) << SDMMC_NISIER_CMDC_Pos)) /* Assigment of value for CMDC in the SDMMC_NISIER register */
#define   SDMMC_NISIER_CMDC_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_NISIER) Masked  */
#define   SDMMC_NISIER_CMDC_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_NISIER) Enabled  */
#define SDMMC_NISIER_CMDC_MASKED              (SDMMC_NISIER_CMDC_MASKED_Val << SDMMC_NISIER_CMDC_Pos) /* (SDMMC_NISIER) Masked Position  */
#define SDMMC_NISIER_CMDC_ENABLED             (SDMMC_NISIER_CMDC_ENABLED_Val << SDMMC_NISIER_CMDC_Pos) /* (SDMMC_NISIER) Enabled Position  */
#define SDMMC_NISIER_TRFC_Pos                 _UINT16_(1)                                          /* (SDMMC_NISIER) Transfer Complete Signal Enable Position */
#define SDMMC_NISIER_TRFC_Msk                 (_UINT16_(0x1) << SDMMC_NISIER_TRFC_Pos)             /* (SDMMC_NISIER) Transfer Complete Signal Enable Mask */
#define SDMMC_NISIER_TRFC(value)              (SDMMC_NISIER_TRFC_Msk & (_UINT16_(value) << SDMMC_NISIER_TRFC_Pos)) /* Assigment of value for TRFC in the SDMMC_NISIER register */
#define   SDMMC_NISIER_TRFC_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_NISIER) Masked  */
#define   SDMMC_NISIER_TRFC_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_NISIER) Enabled  */
#define SDMMC_NISIER_TRFC_MASKED              (SDMMC_NISIER_TRFC_MASKED_Val << SDMMC_NISIER_TRFC_Pos) /* (SDMMC_NISIER) Masked Position  */
#define SDMMC_NISIER_TRFC_ENABLED             (SDMMC_NISIER_TRFC_ENABLED_Val << SDMMC_NISIER_TRFC_Pos) /* (SDMMC_NISIER) Enabled Position  */
#define SDMMC_NISIER_BLKGE_Pos                _UINT16_(2)                                          /* (SDMMC_NISIER) Block Gap Event Signal Enable Position */
#define SDMMC_NISIER_BLKGE_Msk                (_UINT16_(0x1) << SDMMC_NISIER_BLKGE_Pos)            /* (SDMMC_NISIER) Block Gap Event Signal Enable Mask */
#define SDMMC_NISIER_BLKGE(value)             (SDMMC_NISIER_BLKGE_Msk & (_UINT16_(value) << SDMMC_NISIER_BLKGE_Pos)) /* Assigment of value for BLKGE in the SDMMC_NISIER register */
#define   SDMMC_NISIER_BLKGE_MASKED_Val       _UINT16_(0x0)                                        /* (SDMMC_NISIER) Masked  */
#define   SDMMC_NISIER_BLKGE_ENABLED_Val      _UINT16_(0x1)                                        /* (SDMMC_NISIER) Enabled  */
#define SDMMC_NISIER_BLKGE_MASKED             (SDMMC_NISIER_BLKGE_MASKED_Val << SDMMC_NISIER_BLKGE_Pos) /* (SDMMC_NISIER) Masked Position  */
#define SDMMC_NISIER_BLKGE_ENABLED            (SDMMC_NISIER_BLKGE_ENABLED_Val << SDMMC_NISIER_BLKGE_Pos) /* (SDMMC_NISIER) Enabled Position  */
#define SDMMC_NISIER_DMAINT_Pos               _UINT16_(3)                                          /* (SDMMC_NISIER) DMA Interrupt Signal Enable Position */
#define SDMMC_NISIER_DMAINT_Msk               (_UINT16_(0x1) << SDMMC_NISIER_DMAINT_Pos)           /* (SDMMC_NISIER) DMA Interrupt Signal Enable Mask */
#define SDMMC_NISIER_DMAINT(value)            (SDMMC_NISIER_DMAINT_Msk & (_UINT16_(value) << SDMMC_NISIER_DMAINT_Pos)) /* Assigment of value for DMAINT in the SDMMC_NISIER register */
#define   SDMMC_NISIER_DMAINT_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_NISIER) Masked  */
#define   SDMMC_NISIER_DMAINT_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_NISIER) Enabled  */
#define SDMMC_NISIER_DMAINT_MASKED            (SDMMC_NISIER_DMAINT_MASKED_Val << SDMMC_NISIER_DMAINT_Pos) /* (SDMMC_NISIER) Masked Position  */
#define SDMMC_NISIER_DMAINT_ENABLED           (SDMMC_NISIER_DMAINT_ENABLED_Val << SDMMC_NISIER_DMAINT_Pos) /* (SDMMC_NISIER) Enabled Position  */
#define SDMMC_NISIER_BWRRDY_Pos               _UINT16_(4)                                          /* (SDMMC_NISIER) Buffer Write Ready Signal Enable Position */
#define SDMMC_NISIER_BWRRDY_Msk               (_UINT16_(0x1) << SDMMC_NISIER_BWRRDY_Pos)           /* (SDMMC_NISIER) Buffer Write Ready Signal Enable Mask */
#define SDMMC_NISIER_BWRRDY(value)            (SDMMC_NISIER_BWRRDY_Msk & (_UINT16_(value) << SDMMC_NISIER_BWRRDY_Pos)) /* Assigment of value for BWRRDY in the SDMMC_NISIER register */
#define   SDMMC_NISIER_BWRRDY_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_NISIER) Masked  */
#define   SDMMC_NISIER_BWRRDY_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_NISIER) Enabled  */
#define SDMMC_NISIER_BWRRDY_MASKED            (SDMMC_NISIER_BWRRDY_MASKED_Val << SDMMC_NISIER_BWRRDY_Pos) /* (SDMMC_NISIER) Masked Position  */
#define SDMMC_NISIER_BWRRDY_ENABLED           (SDMMC_NISIER_BWRRDY_ENABLED_Val << SDMMC_NISIER_BWRRDY_Pos) /* (SDMMC_NISIER) Enabled Position  */
#define SDMMC_NISIER_BRDRDY_Pos               _UINT16_(5)                                          /* (SDMMC_NISIER) Buffer Read Ready Signal Enable Position */
#define SDMMC_NISIER_BRDRDY_Msk               (_UINT16_(0x1) << SDMMC_NISIER_BRDRDY_Pos)           /* (SDMMC_NISIER) Buffer Read Ready Signal Enable Mask */
#define SDMMC_NISIER_BRDRDY(value)            (SDMMC_NISIER_BRDRDY_Msk & (_UINT16_(value) << SDMMC_NISIER_BRDRDY_Pos)) /* Assigment of value for BRDRDY in the SDMMC_NISIER register */
#define   SDMMC_NISIER_BRDRDY_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_NISIER) Masked  */
#define   SDMMC_NISIER_BRDRDY_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_NISIER) Enabled  */
#define SDMMC_NISIER_BRDRDY_MASKED            (SDMMC_NISIER_BRDRDY_MASKED_Val << SDMMC_NISIER_BRDRDY_Pos) /* (SDMMC_NISIER) Masked Position  */
#define SDMMC_NISIER_BRDRDY_ENABLED           (SDMMC_NISIER_BRDRDY_ENABLED_Val << SDMMC_NISIER_BRDRDY_Pos) /* (SDMMC_NISIER) Enabled Position  */
#define SDMMC_NISIER_CINS_Pos                 _UINT16_(6)                                          /* (SDMMC_NISIER) Card Insertion Signal Enable Position */
#define SDMMC_NISIER_CINS_Msk                 (_UINT16_(0x1) << SDMMC_NISIER_CINS_Pos)             /* (SDMMC_NISIER) Card Insertion Signal Enable Mask */
#define SDMMC_NISIER_CINS(value)              (SDMMC_NISIER_CINS_Msk & (_UINT16_(value) << SDMMC_NISIER_CINS_Pos)) /* Assigment of value for CINS in the SDMMC_NISIER register */
#define   SDMMC_NISIER_CINS_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_NISIER) Masked  */
#define   SDMMC_NISIER_CINS_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_NISIER) Enabled  */
#define SDMMC_NISIER_CINS_MASKED              (SDMMC_NISIER_CINS_MASKED_Val << SDMMC_NISIER_CINS_Pos) /* (SDMMC_NISIER) Masked Position  */
#define SDMMC_NISIER_CINS_ENABLED             (SDMMC_NISIER_CINS_ENABLED_Val << SDMMC_NISIER_CINS_Pos) /* (SDMMC_NISIER) Enabled Position  */
#define SDMMC_NISIER_CREM_Pos                 _UINT16_(7)                                          /* (SDMMC_NISIER) Card Removal Signal Enable Position */
#define SDMMC_NISIER_CREM_Msk                 (_UINT16_(0x1) << SDMMC_NISIER_CREM_Pos)             /* (SDMMC_NISIER) Card Removal Signal Enable Mask */
#define SDMMC_NISIER_CREM(value)              (SDMMC_NISIER_CREM_Msk & (_UINT16_(value) << SDMMC_NISIER_CREM_Pos)) /* Assigment of value for CREM in the SDMMC_NISIER register */
#define   SDMMC_NISIER_CREM_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_NISIER) Masked  */
#define   SDMMC_NISIER_CREM_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_NISIER) Enabled  */
#define SDMMC_NISIER_CREM_MASKED              (SDMMC_NISIER_CREM_MASKED_Val << SDMMC_NISIER_CREM_Pos) /* (SDMMC_NISIER) Masked Position  */
#define SDMMC_NISIER_CREM_ENABLED             (SDMMC_NISIER_CREM_ENABLED_Val << SDMMC_NISIER_CREM_Pos) /* (SDMMC_NISIER) Enabled Position  */
#define SDMMC_NISIER_CINT_Pos                 _UINT16_(8)                                          /* (SDMMC_NISIER) Card Interrupt Signal Enable Position */
#define SDMMC_NISIER_CINT_Msk                 (_UINT16_(0x1) << SDMMC_NISIER_CINT_Pos)             /* (SDMMC_NISIER) Card Interrupt Signal Enable Mask */
#define SDMMC_NISIER_CINT(value)              (SDMMC_NISIER_CINT_Msk & (_UINT16_(value) << SDMMC_NISIER_CINT_Pos)) /* Assigment of value for CINT in the SDMMC_NISIER register */
#define   SDMMC_NISIER_CINT_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_NISIER) Masked  */
#define   SDMMC_NISIER_CINT_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_NISIER) Enabled  */
#define SDMMC_NISIER_CINT_MASKED              (SDMMC_NISIER_CINT_MASKED_Val << SDMMC_NISIER_CINT_Pos) /* (SDMMC_NISIER) Masked Position  */
#define SDMMC_NISIER_CINT_ENABLED             (SDMMC_NISIER_CINT_ENABLED_Val << SDMMC_NISIER_CINT_Pos) /* (SDMMC_NISIER) Enabled Position  */
#define SDMMC_NISIER_Msk                      _UINT16_(0x01FF)                                     /* (SDMMC_NISIER) Register Mask  */

/* EMMC mode */
#define SDMMC_NISIER_EMMC_BOOTAR_Pos          _UINT16_(14)                                         /* (SDMMC_NISIER) Boot Acknowledge Received Signal Enable Position */
#define SDMMC_NISIER_EMMC_BOOTAR_Msk          (_UINT16_(0x1) << SDMMC_NISIER_EMMC_BOOTAR_Pos)      /* (SDMMC_NISIER) Boot Acknowledge Received Signal Enable Mask */
#define SDMMC_NISIER_EMMC_BOOTAR(value)       (SDMMC_NISIER_EMMC_BOOTAR_Msk & (_UINT16_(value) << SDMMC_NISIER_EMMC_BOOTAR_Pos))
#define SDMMC_NISIER_EMMC_Msk                 _UINT16_(0x4000)                                      /* (SDMMC_NISIER_EMMC) Register Mask  */


